# -*- coding: utf-8 -*-
def hours_2_str(arg):
    ln = len(arg)
    rezult = ""
    hundred = {'1':"ста",
                   '2':"двести",
                   '3':"триста",
                   '4':"четыреста",
                   '5':"пятьсот",
                   '6':"шестьсот",
                   '7':"семьсот",
                   '8':"восемьсот",
                   '9':"девятьсот"}
    ten = {'2':"двадцати",
           '3':"тридцати",
           '4':"сорока",
           '5':"пятидесяти",
           '6':"шестидесяти",
           '7':"семидесяти",
           '8':"восьмидесяти",
           '9':"девяноста",
           '0':""}
    unit = {'0':"",
            '1':"одного",
            '2':"двух",
            '3':"трех",
            '4':"четырех",
            '5':"пяти",
            '6':"шести",
            '7':"семи",
            '8':"восьми",
            '9':"девяти"}
    second_ten = {'10':"десяти",
                  '11':"одиннадцати",
                  '12':"двенадцати",
                  '13':"тринадцати",
                  '14':"четырнадцати",
                  '15':"пятнадцати",
                  '16':"шестнадцати",
                  '17':"семнадцати",
                  '18':"восемнадцати",
                  '19':"девятнадцати"}          
    if ln == 3:
        rezult += hundred[arg[0]]
        arg = arg[1:]
        ln = ln - 1
        rezult += ' ' 
    if ln == 2:
        if arg[0] == '1':
            rezult += second_ten[arg]
        else:
            rezult += ten[arg[0]] + ' ' +unit[arg[1]]
    if ln == 1:
        rezult += unit[arg]
    if rezult == "":
        return 'Too much hours'
    return ' (' + rezult + ')'

        
       
